=================
style declaration
=================
my_style : : style{};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style)))

=================
style property declaration
=================
my_style : : style{
  --bar: "bar";
};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string))))))

=================
style property declaration - terminator
=================
my_style : : style{
  --bar: "bar";
};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string))))))

=================
style with multiple property declarations
=================
my_style : : style{
  --bar: "bar";
  foo: "foo";
};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string)))
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string))))))

=================
style comment
=================
my_style :: style {
  /* comment */
};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style
      (comment_block))))

=================
style comment before declaration
=================
my_style :: style {
  /* comment */
  foo: "bar";
};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style
      (comment_block)
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string))))))

=================
style comment after declaration
=================
my_style :: style {
  foo: "bar";
  /* comment */
};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string)))
      (comment_block))))

=================
style comment between declarations
=================
my_style :: style {
  --bar: "bar";
  /* comment */
  foo: "bar";
};
---

(source_file
  (const_declaration
    name: (identifier)
    value: (style
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string)))
      (comment_block)
      (css_property_declaration
        name: (identifier)
        value: (property_value
          (string))))))
