==================
Basic dir statement
==================
@dir("hello")
---

(source_file
  (call
    (identifier_builtin)
    (string)))

==================
Dir statement with separator
==================
@dir("hello");
---

(source_file
  (call
    (identifier_builtin)
    (string)))

==================
Dir statement with member access
==================
@dir(hello.world)
---

(source_file
  (call
    (identifier_builtin)
    (member_access
      (identifier)
      (identifier))))

==================
Const statement
==================
my_const :: "hello"
---

(source_file
  (const_declaration
    (identifier)
    (string)))

==================
Const statement with type
==================
my_const : number : 123
---

(source_file
  (const_declaration
    (identifier)
    (type_identifier)
    (number)))

==================
Comment
==================
// this is a comment
---

(source_file
  (comment_line))

==================
Multiple statements
==================
// comment
@dir("hello")
my_const :: 123
---

(source_file
  (comment_line)
  (call
    (identifier_builtin)
    (string))
  (const_declaration
    (identifier)
    (number)))
